In [1]:
!pip install cx_oracle

Requirement already satisfied: cx_oracle in c:\users\kal19\anaconda3\lib\site-packages (8.3.0)

WARNING: Ignoring invalid distribution -pencv-python (c:\users\kal19\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -illow (c:\users\kal19\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -pencv-python (c:\users\kal19\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -illow (c:\users\kal19\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -pencv-python (c:\users\kal19\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -illow (c:\users\kal19\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -pencv-python (c:\users\kal19\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -illow (c:\users\kal19\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -pencv-python (c:\users\kal19\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -illow (c:\users\kal19\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -pencv-python (c:\users\kal19\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -illow (c:\users\kal19\anaconda3\lib\site-packages)

In [2]:
import cx_Oracle 
dsn = cx_Oracle.makedsn('localhost',1521,'xe')
dsn

'(DESCRIPTION=(ADDRESS=(PROTOCOL=TCP)(HOST=localhost)(PORT=1521))(CONNECT_DATA=(SID=xe)))'

DB 연결

In [3]:
db = cx_Oracle.connect('C##CAKD5','cakd5',dsn)
db

DB에서 파이썬으로 가져와서 dataframe으로 만들어서 분석작업을 가능하게 할 수 있다. 그와 반대되는 과정도 가능하다

In [4]:

import pandas as pd
cursor = db.cursor()
cursor.execute('select*from book')
x = cursor.fetchall()

columns=['BOOKID','BOOKNAME','PUBLISHER','PRICE']
df = pd.DataFrame(x,columns=columns)
df.head()

   BOOKID BOOKNAME PUBLISHER  PRICE
0       1   축구의 역사      굿스포츠   7000
1       2  축구아는 여자       나무수  13000
2       3   축구의 이해     대한미디어  22000
3       4   골프 바이블     대한미디어  35000
4       5    피겨 교본      굿스포츠   8000

In [1]:
# create
import cx_Oracle
con = cx_Oracle.connect('C##CAKD5/cakd5@localhost:1521/xe')
cursor = con.cursor()
sql = "create table sample1(id varchar2(10), score number)"
cursor.execute(sql)
cursor.close()
con.commit()
con.close()

DatabaseError: ORA-00955: 기존의 객체가 이름을 사용하고 있습니다.

In [ ]:
# 사용자함수
def insert(t):
    con = cx_Oracle.connect('C##CAKD5/cakd5@localhost:1521/xe')
    cursor = con.cursor()
    sql = "insert into sample1 (id,score) values(:1,:2)"
    cursor.execute(sql,t)
    cursor.close()
    con.commit()
    con.close()
insert(('111',80))

In [ ]:
#insert - executemany
rows = [('112',90),('142',60),('238',25),('832',12),('652',95)]
def insertmany(t):
    con = cx_Oracle.connect('C##CAKD5/cakd5@localhost:1521/xe')
    cursor = con.cursor()
    sql = "insert into sample1 (id,score) values(:1,:2)"
    cursor.executemany(sql,t)
    cursor.close()
    con.commit()
    con.close()
insertmany(rows)

In [ ]:
# Q. 3개의 속성(col01, col02, col03)으로 구성되는 테이블 sample2를 생성하고 10개의 데이터를 입력하세요(사용자 함수 사용)
# 단, col에 대하여 제약조건 primary key설정(제약조건 이름 sample_pk)

In [7]:
import cx_Oracle
con = cx_Oracle.connect('C##CAKD5/cakd5@localhost:1521/xe')
cursor = con.cursor()
sql = "create table sample2(col01 varchar2(10), col02 varchar2(10),col03 varchar2(10),constraint sample_pk primary key(col01))"
cursor.execute(sql)
cursor.close()
con.commit()
con.close()

In [8]:
def insertcol(t):
    con = cx_Oracle.connect('C##CAKD5/cakd5@localhost:1521/xe')
    cursor = con.cursor()
    sql ="insert into sample2 (col01,col02,col03) values(:1,:2,:3)"
    cursor.executemany(sql,t)
    cursor.close()
    con.commit()
    con.close()
rows = [('10','1','1'),('1','8','1'),('2','1','1'),('3','1','1'),('4','1','1'),('5','1','1'),('6','1','1'),('7','1','1'),('8','1','1'),('9','1','1')]
insertcol(rows)

In [10]:
#update
def updatecol(t):
    con = cx_Oracle.connect('C##CAKD5/cakd5@localhost:1521/xe')
    cursor = con.cursor()
    sql = "update sample2 set col03=:2 where col03=:2 "
    cursor.execute(sql,t)
    cursor.close()
    con.commit()
    con.close()
updatecol(('3','1'))

In [11]:
#delete
def deletecol(t):
    con = cx_Oracle.connect('C##CAKD5/cakd5@localhost:1521/xe')
    cursor = con.cursor()
    sql = "delete sample2 where col01=:1 "
    cursor.execute(sql,t)
    cursor.close()
    con.commit()
    con.close()
deletecol(('10',))

In [12]:
import pandas as pd
con = cx_Oracle.connect('C##CAKD5/cakd5@localhost:1521/xe')
cursor = con.cursor()
sql = "select*from sample2"
cursor.execute(sql)
x= cursor.fetchall()
df_col = pd.DataFrame(x)
cursor.execute("select column_name from user_tab_columns where table_name = 'SAMPLE2'")
col = cursor.fetchall()
list_py =[]
for i in col:
    for j in i:
        list_py.append(j)
df_col.columns = list_py
df_col.head()
#print(df_col)
#cursor.close()
#con.close()

  COL01 COL02 COL03
0     1     8     3
1     2     1     3
2     3     1     3
3     4     1     3
4     5     1     3

In [16]:
df_col.to_csv('./data/col3.csv')

In [20]:
import csv
with open('./data/col3.csv','r') as csv_file:
    csv_reader = csv.reader(csv_file)
    next(csv_reader)
    data = []
    for line in csv_reader:
        data.append((line[1],line[2],line[3]))
    data
csv_reader

In [ ]:
with open('./data/col3.csv','r') as csv_file:
    csv_reader = csv.reader(csv_file)
    next(csv_reader)
    con = cx_

In [22]:
# 한글깨질때 인코딩 하는방법 
with open('./data/col3.csv','r',encoding="UTF-8") as csv_file:
    csv_reader = csv.reader(csv_file)
    next(csv_reader)
    data = []
    for line in csv_reader:
        data.append((line[1],line[2],line[3]))
data

[('1', '8', '3'),
 ('2', '1', '3'),
 ('3', '1', '3'),
 ('4', '1', '3'),
 ('5', '1', '3'),
 ('6', '1', '3'),
 ('7', '1', '3'),
 ('8', '1', '3'),
 ('9', '1', '3')]

In [23]:
con = cx_Oracle.connect('C##CAKD5/cakd5@localhost:1521/xe')
cursor = con.cursor()
sql = "alter table sample2 drop constraint sample_pk"
cursor.execute(sql)
cursor.close()
con.commit()
con.close()

In [24]:
with open('./data/col3.csv','r') as csv_file:
    csv_reader = csv.reader(csv_file)
    next(csv_reader)
    con = cx_Oracle.connect('C##CAKD5/cakd5@localhost:1521/xe')
    cursor = con.cursor()
    sql = "insert into sample2(col01,col02,col03) values(:1,:2,:3)"
    data = []
    for line in csv_reader:
        data.append((line[1],line[2],line[3]))
    cursor.executemany(sql,data)
    cursor.close()
    con.commit()
    con.close()

In [50]:
# 대량 데이터 입력
import numpy as np
import pandas as pd

df = pd.DataFrame()
df['id'] = np.arange(10000)
df['sales'] = np.random.randint(1,100,size=10000)
df.head()

   id  sales
0   0     33
1   1      5
2   2     92
3   3     50
4   4      4

In [ ]:
con = cx_Oracle.connect('C##CAKD5/cakd5@localhost:1521/xe')
cursor = con.cursor()
sql='insert into sample3 (id,sales) values (:1,:2)'
id = df.id.to_list()
sales = df.sales.to_list()
data = []
for i,v in zip(id,sales):
    data.append((i,v))
cursor.executemany(sql,data)
cursor.close()
con.commit()
con.close()

In [61]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      10000 non-null  int32
 1   sales   10000 non-null  int32
dtypes: int32(2)
memory usage: 78.2 KB

In [62]:
df['id'] = df.id.astype('str')

In [63]:
ar = df.values
results = list([tuple(e) for e in ar])
results[:10]

[('0', 33),
 ('1', 5),
 ('2', 92),
 ('3', 50),
 ('4', 4),
 ('5', 89),
 ('6', 1),
 ('7', 21),
 ('8', 51),
 ('9', 7)]

In [65]:
import cx_Oracle
con = cx_Oracle.connect('C##CAKD5/cakd5@localhost:1521/xe')
cursor = con.cursor()
sql = "insert into sample3(id,score) values(:1,:2)"
#data = []
#for r in results:
#    data.append((r[0],r[1]))
cursor.executemany(sql,results)
cursor.close()
con.commit()
con.close()

In [ ]:
# Q. ID의 자료타입을 NUMBER로 변경하여 ID 기준으로 올림차순으로 정렬하여 출력하세요.

In [54]:
df['id'] = df.id.astype('int')

In [56]:
ar = df.values
results = list([tuple(e) for e in ar])
results[:10]

[(0, 33),
 (1, 5),
 (2, 92),
 (3, 50),
 (4, 4),
 (5, 89),
 (6, 1),
 (7, 21),
 (8, 51),
 (9, 7)]

In [66]:
con = cx_Oracle.connect('C##CAKD5/cakd5@localhost:1521/xe')
cursor = con.cursor()
sql = "truncate table sample3"
cursor.executemany(sql)
cursor.close()
con.commit()
con.close()

TypeError: function missing required argument 'parameters' (pos 2)

[과제] employees 테이블을 불러와서 다음사항을 수행하세요
 
 - 컬럼명을 포함하여 employees 테이블을 데이터프레임으로 출력
 - department_id별 평균 연봉을 출력
 - 부서별 평균 연봉을 수평 그래프로 시각화

In [70]:
import pandas as pd
cursor = db.cursor()
cursor.execute('select*from employees')
x = cursor.fetchall()

columns=['EMPLOYEE_ID','FIRST_NAME','LAST_NAME','EMAIL','PHONE_NUMBER','HIRE_DATE','JOB_ID','SALARY','COMMISSION_PCT','MANAGER_ID','DEPARTMENT_ID']
df2 = pd.DataFrame(x,columns=columns)
df2

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
0,100,Steven,King,SKING,515.123.4567,2003-06-17,AD_PRES,24000.0,NaN,NaN,90.0
1,101,Neena,Kochhar,NKOCHHAR,515.123.4568,2005-09-21,AD_VP,17000.0,NaN,100.0,90.0
2,102,Lex,De Haan,LDEHAAN,515.123.4569,2001-01-13,AD_VP,17000.0,NaN,100.0,90.0
3,103,Alexander,Hunold,AHUNOLD,590.423.4567,2006-01-03,IT_PROG,9000.0,NaN,102.0,60.0
4,104,Bruce,Ernst,BERNST,590.423.4568,2007-05-21,IT_PROG,6000.0,NaN,103.0,60.0
...,...,...,...,...,...,...,...,...,...,...,...
102,202,Pat,Fay,PFAY,603.123.6666,2005-08-17,MK_REP,6000.0,NaN,201.0,20.0
103,203,Susan,Mavris,SMAVRIS,515.123.7777,2002-06-07,HR_REP,6500.0,NaN,101.0,40.0
104,204,Hermann,Baer,HBAER,515.123.8888,2002-06-07,PR_REP,10000.0,NaN,101.0,70.0
105,205,Shelley,Higgins,SHIGGINS,515.123.8080,2002-06-07,AC_MGR,12008.0,NaN,101.0,110.0
106,206,William,Gietz,WGIETZ,515.123.8181,2002-06-07,AC_ACCOUNT,8300.0,NaN,205.0,110.0

In [69]:
col_avg = df2.mean()
print(col_avg,"\n")

EMPLOYEE_ID        153.000000
SALARY            6461.831776
COMMISSION_PCT       0.222857
MANAGER_ID         124.764151
DEPARTMENT_ID       63.207547
dtype: float64

C:\Users\kal19\AppData\Local\Temp/ipykernel_17112/4078411026.py:1: FutureWarning: DataFrame.mean and DataFrame.median with numeric_only=None will include datetime64 and datetime64tz columns in a future version.
  col_avg = df2.mean()
C:\Users\kal19\AppData\Local\Temp/ipykernel_17112/4078411026.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  col_avg = df2.mean()

[과제] PURPROD 테이블을 불러와서 다음사항을 수행하시오
 - 고객별 2014년 2015년 총구매액 및 평균구매액내역출력
 - 고객별 2014 VS 2015 총구매액 기준 성장율

In [ ]:
dk